Repository: neveswesley/NvSystem
Catalog: src/Shared/NvSystem.Communications/ResourceMessagesException.*.resx
Languages: es, pt_pt

source: Unknown error.
es: Error desconocido.
pt_pt: Erro desconhecido.

# CATEGORY_ID_EMPTY
source: Category id cannot be empty.
es: El id de la categoría no puede estar vacío.
pt_pt: O id da categoria não pode estar vazio.

# NAME_EMPTY
source: Name cannot be empty.
es: El nombre no puede estar vacío.
pt_pt: O nome não pode estar vazio.

# NAME_MAX_LENGTH
source: Name must be no more than 100 characters.
es: El nombre no debe tener más de 100 caracteres.
pt_pt: O nome não pode ter mais de 100 caracteres.

# NAME_MIN_LENGTH
source: Name must be at least 2 characters long.
es: El nombre debe tener al menos 2 caracteres.
pt_pt: O nome deve ter pelo menos 2 caracteres.

# PRICE_EMPTY
source: Sale price cannot be empty.
es: El precio de venta no puede estar vacío.
pt_pt: O preço de venda não pode estar vazio.

# PRICE_GREATER_THAN
source: Sale price must be greater than 0.
es: El precio de venta debe ser mayor que 0.
pt_pt: O preço de venda deve ser superior a 0.

# STOCK_QUANTITY_EMPTY
source: Stock quantity cannot be empty.
es: La cantidad en stock no puede estar vacía.
pt_pt: A quantidade em stock não pode estar vazia.

# STOCK_QUANTITY_GREATER_THAN
source: Stock quantity must be greater than 0.
es: La cantidad en stock debe ser mayor que 0.
pt_pt: A quantidade em stock deve ser superior a 0.

# EMAIL_EMPTY
source: The email address cannot be empty.
es: La dirección de correo electrónico no puede estar vacía.
pt_pt: O endereço de e-mail não pode estar vazio.

# EMAIL_ADDRESS
source: Invalid email address.
es: Dirección de correo electrónico inválida.
pt_pt: Endereço de e-mail inválido.

# PASSWORD_MIN_LENGTH
source: The password must contain at least 6 characters.
es: La contraseña debe contener al menos 6 caracteres.
pt_pt: A palavra-passe precisa conter pelo menos 6 caracteres.

# PASSWORD_EMPTY
source: The password cannot be empty.
es: La contraseña no puede estar vacía.
pt_pt: A palavra-passe não pode estar vazia.

# EMAIL_EXIST
source: The email is already in use.
es: El correo electrónico ya está en uso.
pt_pt: O e-mail já está em uso.
